<a href="https://colab.research.google.com/github/pbabvey/coding_brush_up/blob/master/Pandas_All_About.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Read, save, ... csv files

In [ ]:
import pandas as pd

df = pd.DataFrame({'Color': ['Red', 'Red', 'Blue'], 'State': ['MA', 'PA', 'PA']})
print(df)
df.to_csv('sample.csv', encoding='utf-8', index=False)

  Color State
0   Red    MA
1   Red    PA
2  Blue    PA

In [ ]:
print(df.shape)

(3, 2)

In [ ]:
df_renamed = df.rename(columns={"Color": "clr.", "State": "St."})
df_renamed

    clr St.
0   Red  MA
1   Red  PA
2  Blue  PA

In [ ]:
df = pd.DataFrame({'num_legs': [2, 4, 8, 0],
                   'num_wings': [2, 0, 0, 0],
                   'num_specimen_seen': [10, 2, 1, 8]},
                  index=['falcon', 'dog', 'spider', 'fish'])

display(df.head(5))
print(df)
# get headers
print(df.columns)
print(df.index)

        num_legs  num_wings  num_specimen_seen
falcon         2          2                 10
dog            4          0                  2
spider         8          0                  1
fish           0          0                  8

        num_legs  num_wings  num_specimen_seen
falcon         2          2                 10
dog            4          0                  2
spider         8          0                  1
fish           0          0                  8
Index(['num_legs', 'num_wings', 'num_specimen_seen'], dtype='object')
Index(['falcon', 'dog', 'spider', 'fish'], dtype='object')

In [ ]:
# Another way of generating dataframe from tuples 
students = [ ('Rahul', 22, 'Sydeny' , 'Australia') ,
('Parul', 23, 'Pune' , 'India')  ]
#Create a DataFrame object
df = pd.DataFrame(students, columns = ['Name' , 'Age', 'City' , 'Country'], index=['a', 'b']) 
# get the row as dictionary
print(dict(df.loc['a']))
# more inforamtion about loc
# https://www.shanelynn.ie/select-pandas-dataframe-rows-and-columns-using-iloc-loc-and-ix/

{'Name': 'Rahul', 'Age': 22, 'City': 'Sydeny', 'Country': 'Australia'}

##rename columns, handle row names, select part of df

In [ ]:
import pandas as pd
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df.rename(columns={"A": "a", "B": "c"})

   a  c
0  1  4
1  2  5
2  3  6

In [ ]:
# except one column
df.loc[:, df.columns != 'b']

In [ ]:
df.index.values
df.columns.values

## set column as index

In [ ]:
import pandas as pd
df = pd.DataFrame({'month': [1, 4, 7, 10],
                   'year': [2012, 2014, 2013, 2014],
                   'sale': [55, 40, 84, 31]})
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [ ]:
df.set_index('month')

KeyError: ignored

In [ ]:
# be careful it's not in place
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

## set index as column
convert index to one of the columns: https://stackoverflow.com/questions/20461165/how-to-convert-index-of-a-pandas-dataframe-into-a-column

##convert df to string 
use this [link](https://stackoverflow.com/questions/37877708/how-to-turn-a-pandas-dataframe-row-into-a-comma-separated-string)

## Change object to int, float

https://www.kite.com/python/answers/how-to-convert-a-pandas-dataframe-column-from-object-to-int-in-python

In [ ]:
7*12*2

168

# value_counts, frequency counter

In [ ]:
import pandas as pd
df = pd.DataFrame({'Color': ['Red', 'Red', 'Blue'], 'State': ['MA', 'PA', 'PA']})
print(df)
#get the hisogram of elements in dataframe
df.Color.value_counts()

  Color State
0   Red    MA
1   Red    PA
2  Blue    PA

Red     2
Blue    1
Name: Color, dtype: int64

In [ ]:
#an interesting way to find a new dataframe using the frequency of elements in a list
dff = df.Color.value_counts().reset_index().rename(columns={'index': 'Color', 'Color': 'Count'})
print(dff)

  Color  Count
0   Red      2
1  Blue      1

# Choosing parts of the dataframe

Columns

In [ ]:
length = [32,45,65,12,34]
name =['Asad','Javad','naghi','Khasha','Arvin']
weight =[54,32,11,79,100]
info = {'length':length, 'name':name, 'weight':weight}
#making df from a dict={header:list}
df = pd.DataFrame(info)
print(df,'\n')
df_1 = df[['name','length']]
print(df_1)

   length    name  weight
0      32    Asad      54
1      45   Javad      32
2      65   naghi      11
3      12  Khasha      79
4      34   Arvin     100

     name  length
0    Asad      32
1   Javad      45
2   naghi      65
3  Khasha      12
4   Arvin      34

In [ ]:
#converting a dataframs into a list of numpy lists
df_2= df.values
print(df_2)
print(df_2[0][0])

[[32 'Asad' 54]
 [45 'Javad' 32]
 [65 'naghi' 11]
 [12 'Khasha' 79]
 [34 'Arvin' 100]]
32

In [ ]:
# get one specific row
print(df.loc[0])

#get one specific row
print('\n')
print(df.iloc[0])

length      32
name      Asad
weight      54
Name: 0, dtype: object


length      32
name      Asad
weight      54
Name: 0, dtype: object

In [ ]:
df.sample(frac=1).reset_index(drop=True)

In [ ]:
#change of the type of a column
df = pd.DataFrame({'num_legs': [2, 4, 8, 0],
                   'num_wings': [2, 0, 0, 0],
                   'num_specimen_seen': [10, 2, 1, 8]})
print(df['num_legs'].astype(str))
print(df['num_legs'].astype(int))

0    2
1    4
2    8
3    0
Name: num_legs, dtype: object
0    2
1    4
2    8
3    0
Name: num_legs, dtype: int64

In [ ]:
highest_3 = df.nlargest(3, ['average-mileage'])
lowest_3 = df.nsmallest(3, ['average-mileage'])

In [ ]:
# you can find cars.csv from the homeworks of 624
import pandas as pd
cars=pd.read_csv('cars.csv')
print('\n',cars.head(3))
print('\n',cars.tail(3))
top = cars.sort_values(by='average-mileage', ascending=False)
print(top.head(3)) # Top 5 
low = cars.sort_values(by='average-mileage', ascending=True)
print(low.head(3))# low 5

    index      company   body-style  ...  horsepower  average-mileage    price
0      0  alfa-romero  convertible  ...         111               21  13495.0
1      1  alfa-romero  convertible  ...         111               21  16500.0
2      2  alfa-romero    hatchback  ...         154               19  16500.0

[3 rows x 10 columns]

     index     company body-style  ...  horsepower  average-mileage    price
58     86  volkswagen      sedan  ...         100               26   9995.0
59     87       volvo      sedan  ...         114               23  12940.0
60     88       volvo      wagon  ...         114               23  13415.0

[3 rows x 10 columns]
    index    company body-style  ...  horsepower  average-mileage   price
13     16  chevrolet  hatchback  ...          48               47  5151.0
40     53     nissan      sedan  ...          55               45  7099.0
15     18  chevrolet      sedan  ...          70               38  6575.0

[3 rows x 10 columns]
    index        company body-style  ...  horsepower  average-mileage    price
26     35         jaguar      sedan  ...         262               13  36000.0
34     46  mercedes-benz      sedan  ...         184               14  40960.0
35     47  mercedes-benz    hardtop  ...         184               14  45400.0

[3 rows x 10 columns]

In [ ]:
print(cars.head(5))
print(cars.tail(4))

   index      company   body-style  ...  horsepower  average-mileage    price
0      0  alfa-romero  convertible  ...         111               21  13495.0
1      1  alfa-romero  convertible  ...         111               21  16500.0
2      2  alfa-romero    hatchback  ...         154               19  16500.0
3      3         audi        sedan  ...         102               24  13950.0
4      4         audi        sedan  ...         115               18  17450.0

[5 rows x 10 columns]
    index     company body-style  ...  horsepower  average-mileage    price
57     82  volkswagen      sedan  ...          52               37   7995.0
58     86  volkswagen      sedan  ...         100               26   9995.0
59     87       volvo      sedan  ...         114               23  12940.0
60     88       volvo      wagon  ...         114               23  13415.0

[4 rows x 10 columns]

# Change type of data

In [ ]:
import pandas as pd
df = pd.DataFrame({'num_legs': [2, 4, 8, 0],
                   'num_wings': [2, 0, 0, 0],
                   'num_specimen_seen': [10, 2, 1, 8]})
df.dtypes

num_legs             int64
num_wings            int64
num_specimen_seen    int64
dtype: object

In [ ]:
df['num_legs'].astype('int32').dtypes

dtype('int32')

In [ ]:
df['num_legs'] = df['num_legs'].astype('int32')
df.dtypes

num_legs             int32
num_wings            int64
num_specimen_seen    int64
dtype: object

# Math Operations, div,

In [ ]:
import pandas as pd
length = [10,20,60,90,360]
weight =[54,32,11,79,100]
info = {'length':length, 'weight':weight}
#making df from a dict={header:list}
df = pd.DataFrame(info)
# divide by the first row
df.divide(df.iloc[0])

   length    weight
0     1.0  1.000000
1     2.0  0.592593
2     6.0  0.203704
3     9.0  1.462963
4    36.0  1.851852

In [ ]:
# divide each row by the previous row and put a default value for the first row
df.div(df.shift(1,fill_value=1))

   length     weight
0    10.0  54.000000
1     2.0   0.592593
2     3.0   0.343750
3     1.5   7.181818
4     4.0   1.265823

# loc, iloc, ix, iteration

In [ ]:
https://www.shanelynn.ie/select-pandas-dataframe-rows-and-columns-using-iloc-loc-and-ix/

In [ ]:
length = [32,45,65,12,34]
name =['Asad','Javad','naghi','Khasha','Arvin']
weight =[54,32,11,79,100]
info = {'length':length, 'name':name, 'weight':weight}
#making df from a dict={header:list}
df = pd.DataFrame(info)
print(df,'\n')
df_1 = df[['name','length']]
print(df_1)

   length    name  weight
0      32    Asad      54
1      45   Javad      32
2      65   naghi      11
3      12  Khasha      79
4      34   Arvin     100

     name  length
0    Asad      32
1   Javad      45
2   naghi      65
3  Khasha      12
4   Arvin      34

In [ ]:
#iteration
for index, row in df.iterrows():
    print(row['name'], row['length'])

# Manage Index
A dataframe may have several indices.

How to convert index to a column
https://stackoverflow.com/questions/20461165/how-to-convert-index-of-a-pandas-dataframe-into-a-column

# groupby

In [ ]:
# groupby
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon', 'Parrot', 'Parrot'], 'Max Speed': [380., 370., 24., 26.]})

print(df.groupby('Animal').count() , '\n')
print(df.groupby(['Animal']).mean() , '\n')
print(df.groupby(['Animal']).std() , '\n')
print(df.groupby(['Animal']).sum() , '\n')
print(df.groupby(['Animal']).size() , '\n')

        Max Speed
Animal
Falcon          2
Parrot          2

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

        Max Speed
Animal
Falcon   7.071068
Parrot   1.414214

        Max Speed
Animal
Falcon      750.0
Parrot       50.0

Animal
Falcon    2
Parrot    2
dtype: int64

For more than two items (for example mean and count check [this](https://stackoverflow.com/questions/41040132/pandas-groupby-count-and-mean-combined))

# concat, merge, .apply, map, assign <br>
check this link:
https://thispointer.com/pandas-how-to-merge-dataframes-using-dataframe-merge-in-python-part-1/

In [ ]:
import pandas as pd
# merge is differnet from concat
df1 = pd.DataFrame({'Color': ['Red', 'Red', 'Blue', 'Yellow','Red', 'Pink'], 'State': ['MA', 'PA', 'PA','NJ','NJ', 'NY']})
df2 = pd.DataFrame({'Color': ['Red', 'Green', 'Blue','Yellow','Pink','Purple', 'Red'], 'Age': [12, 14, 5, 11, 25, 19, 12]})
#merge do some specific ....
df = pd.merge(df1, df2)
print(df)

    Color State  Age
0     Red    MA   12
1     Red    MA   12
2     Red    PA   12
3     Red    PA   12
4     Red    NJ   12
5     Red    NJ   12
6    Blue    PA    5
7  Yellow    NJ   11
8    Pink    NY   25

In [ ]:
df = pd.merge(df1, df2,how='left')
print(df)

    Color State  Age
0     Red    MA   12
1     Red    MA   12
2     Red    PA   12
3     Red    PA   12
4    Blue    PA    5
5  Yellow    NJ   11
6     Red    NJ   12
7     Red    NJ   12
8    Pink    NY   25

In [ ]:
df_ = df.groupby("State").mean()
df_

        Age
State
MA     12.0
NJ     11.5
NY     25.0
PA      8.5

In [ ]:
df_ = df.index[df['Age'] >9]
print(df_)

df_ = df[df['Age'] >9]
print(df_)

Int64Index([0, 1, 2, 4, 5], dtype='int64')
    Color State  Age
0     Red    MA   12
1     Red    PA   12
2     Red    NJ   12
4  Yellow    NJ   11
5    Pink    NY   25

In [ ]:
result = pd.concat([df1, df2], axis=1, sort=False)
result

    Color State   Color   Age   Color State
0     Red    MA     Red  12.0     Red    MA
1     Red    PA   Green  14.0     Red    PA
2    Blue    PA    Blue   5.0    Blue    PA
3  Yellow    NJ  Yellow  11.0  Yellow    NJ
4     Red    NJ     NaN   NaN     Red    NJ

In [ ]:
result = pd.concat([df1, df2], axis=0, sort=False)
result

    Color State   Age
0     Red    MA   NaN
1     Red    PA   NaN
2    Blue    PA   NaN
3  Yellow    NJ   NaN
4     Red    NJ   NaN
0     Red   NaN  12.0
1   Green   NaN  14.0
2    Blue   NaN   5.0
3  Yellow   NaN  11.0

In [ ]:
df1['Code'] = df1['Color'].apply(lambda x: x[0])
df1

    Color State Code
0     Red    MA    R
1     Red    PA    R
2    Blue    PA    B
3  Yellow    NJ    Y
4     Red    NJ    R
5    Pink    NY    P

instead of .apply(lambda x: f(x)) you can use assign

In [ ]:
df1.assign(Color_len=lambda x: x.Color)

    Color State Code Color_len
0     Red    MA    R      Blue
1     Red    PA    R      Blue
2    Blue    PA    B      Blue
3  Yellow    NJ    Y      Blue
4     Red    NJ    R      Blue
5    Pink    NY    P      Blue

In [ ]:
df = pd.DataFrame({'temp_c': [17.0, 25.0]},
                  index=['Portland', 'Berkeley'])

In [ ]:
df.assign(temp_f=lambda x: x.temp_c * 9 / 5 + 32)

          temp_c  temp_f
Portland    17.0    62.6
Berkeley    25.0    77.0

# Pivotal Table

Generate a table with mean, sum, etc of the variables in the dataframe

In [ ]:
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html
mean_ratings= pd.pivot_table(df, values='Age', columns='Color', index='State', aggfunc='mean')
mean_ratings

Color  Blue   Red  Yellow
State
MA      NaN  12.0     NaN
NJ      NaN  12.0    11.0
PA      5.0  12.0     NaN

In [ ]:
df = pd.DataFrame( {'a':['A','A','B','B','B','C'], 'b':[1,2,5,5,4,6]})
df1 = df.groupby('a')['b'].apply(list).reset_index(name='new')
print(df1,'\n')
df2 = df.groupby('a')['b'].mean().reset_index(name='new')
print(df2)

   a        new
0  A     [1, 2]
1  B  [5, 5, 4]
2  C        [6]

   a       new
0  A  1.500000
1  B  4.666667
2  C  6.000000

## Reading a File and processing it

In [ ]:
import pandas as pd
# this file exist in the midterm of EM-624
# it's better to replace it with the online csv file
cars = pd.read_csv("cars.csv")
cars

    index      company   body-style  ...  horsepower  average-mileage    price
0       0  alfa-romero  convertible  ...         111               21  13495.0
1       1  alfa-romero  convertible  ...         111               21  16500.0
2       2  alfa-romero    hatchback  ...         154               19  16500.0
3       3         audi        sedan  ...         102               24  13950.0
4       4         audi        sedan  ...         115               18  17450.0
..    ...          ...          ...  ...         ...              ...      ...
56     81   volkswagen        sedan  ...          85               27   7975.0
57     82   volkswagen        sedan  ...          52               37   7995.0
58     86   volkswagen        sedan  ...         100               26   9995.0
59     87        volvo        sedan  ...         114               23  12940.0
60     88        volvo        wagon  ...         114               23  13415.0

[61 rows x 10 columns]

# Change types of columns

In [ ]:
#check type and change type
import numpy as np
cars=pd.read_csv('cars.csv')
print(cars.columns)
cars = cars.astype({'average-mileage': 'int64'})


for y in cars.columns:
  print(cars[y].dtype)
  if(cars[y].dtype == np.float64 or cars[y].dtype == np.int64):
      print(y)
      #np.float(cars[y])
  else:
      #np.float(cars[y])
      pass

Index(['index', 'company', 'body-style', 'wheel-base', 'length', 'engine-type',
       'num-of-cylinders', 'horsepower', 'average-mileage', 'price'],
      dtype='object')
int64
index
object
object
float64
wheel-base
float64
length
object
object
int64
horsepower
int64
average-mileage
float64
price

# Replace

In [ ]:
data.Occupation.replace(range(0,21,1), ["Other/

# Change the order by sort

In [ ]:
cars1 = cars.sort_values('average-mileage',ascending = True)
cars1.head(5)

    index        company   body-style  ...  horsepower  average-mileage    price
26     35         jaguar        sedan  ...         262               13  36000.0
34     46  mercedes-benz        sedan  ...         184               14  40960.0
35     47  mercedes-benz      hardtop  ...         184               14  45400.0
24     33         jaguar        sedan  ...         176               15  32250.0
12     15            bmw        sedan  ...         182               15  36880.0
25     34         jaguar        sedan  ...         176               15  35550.0
11     14            bmw        sedan  ...         182               16  41315.0
10     13            bmw        sedan  ...         182               16  30760.0
30     39          mazda    hatchback  ...         101               17  11845.0
47     63        porsche    hatchback  ...         288               17      NaN
46     62        porsche  convertible  ...         207               17  37028.0
45     61        porsche      hardtop  ...         207               17  34028.0
4       4           audi        sedan  ...         115               18  17450.0
44     57         nissan        sedan  ...         152               19  13499.0
6       6           audi        wagon  ...         110               19  18920.0
5       5           audi        sedan  ...         110               19  15250.0
2       2    alfa-romero    hatchback  ...         154               19  16500.0
54     79         toyota        wagon  ...         156               19  15750.0
0       0    alfa-romero  convertible  ...         111               21  13495.0
1       1    alfa-romero  convertible  ...         111               21  16500.0

[20 rows x 10 columns]

In [ ]:

gas_mileage= cars.pivot_table('average-mileage', index='company', aggfunc="mean")
print(gas_mileage)
lowest_mileage=gas_mileage.sort_values(by="average-mileage", ascending=True)

print("\nThe 3 cars with the lowest mileage are:\n", lowest_mileage[:3])

#Question 9 part c: Print the three cars with th ehighest avergage mileage
gas_mileage= cars.pivot_table('average-mileage', index='company', aggfunc="mean")

highest_mileage=gas_mileage.sort_values(by="average-mileage", ascending=False)

print("\nThe 3 cars with the lowest mileage are:\n", highest_mileage[:3])

In [ ]:
print(df.head(3))
print(df.tail(3))
#get headers
print(df.columns)

   index      company   body-style  ...  horsepower  average-mileage    price
0      0  alfa-romero  convertible  ...         111               21  13495.0
1      1  alfa-romero  convertible  ...         111               21  16500.0
2      2  alfa-romero    hatchback  ...         154               19  16500.0

[3 rows x 10 columns]
    index     company body-style  ...  horsepower  average-mileage    price
58     86  volkswagen      sedan  ...         100               26   9995.0
59     87       volvo      sedan  ...         114               23  12940.0
60     88       volvo      wagon  ...         114               23  13415.0

[3 rows x 10 columns]
Index(['index', 'company', 'body-style', 'wheel-base', 'length', 'engine-type',
       'num-of-cylinders', 'horsepower', 'average-mileage', 'price'],
      dtype='object')

In [ ]:
#get the frequency of element is a column
print(df['body-style'].value_counts() )
print('\n')
print(df.company.value_counts())

sedan          32
hatchback      15
wagon           9
convertible     3
hardtop         2
Name: body-style, dtype: int64
toyota           7
bmw              6
mazda            5
nissan           5
volkswagen       4
mitsubishi       4
mercedes-benz    4
audi             4
chevrolet        3
jaguar           3
isuzu            3
honda            3
porsche          3
alfa-romero      3
dodge            2
volvo            2
Name: company, dtype: int64

In [ ]:
print(df.nsmallest(3, 'average-mileage'))
print(df.nlargest(3,'average-mileage'))

# Filter rows by conditional

In [ ]:
import pandas as pd
df = pd.DataFrame({'num_legs': [2, 4, 8, 0],
                   'num_wings': [2, 0, 0, 0],
                   'num_specimen_seen': [10, 2, 1, 8]},
                  index=['falcon', 'dog', 'spider', 'fish'])


print(df.columns)

Index(['num_legs', 'num_wings', 'num_specimen_seen'], dtype='object')

In [ ]:
df_filtered = df[df['num_legs'] == 2]
df_filtered = df[(df['num_legs'] > 2) | (df['num_wings']> 1)]
df_filtered

        num_legs  num_wings  num_specimen_seen
falcon         2          2                 10
dog            4          0                  2
spider         8          0                  1

In [ ]:
# another form for the code above
df_filtered = df.loc[df.num_legs == 2]
df_filtered

        num_legs  num_wings  num_specimen_seen
falcon         2          2                 10

In [ ]:
df_index= df.index[df['num_legs']>= 3]
df_index

Index(['dog', 'spider'], dtype='object')

In [ ]:
df_filtered = df[df['num_legs'].isin([2,4])]
df_filtered


#years = [1952, 2007]
#gapminder.year.isin(years)

#gapminder_years= gapminder[gapminder.year.isin(years)]

        num_legs  num_wings  num_specimen_seen
falcon         2          2                 10
dog            4          0                  2

## Filter null

#Sort indexes, add index as column

In [ ]:
sorted_df= df.sort_index(by='num_legs')
sorted_df

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

        num_legs  num_wings  num_specimen_seen
fish           0          0                  8
falcon         2          2                 10
dog            4          0                  2
spider         8          0                  1

In [ ]:
sorted_df['index'] = df.index

## max, largest

In [ ]:
df.nlargest(3, 'a')
df.nsmallest(3, 'a')

# Visualization

multiple bar charts:
https://stackoverflow.com/questions/35248976/pandas-plot-dataframe-as-multiple-bar-charts

In [ ]:
# bar plot

# Quantile

In [ ]:
# Python Program illustrating  
# numpy.quantile() method  
import numpy as np 
  
  
# 1D array  
arr = [20, 2, 7, 1, 34] 
arr = range(4,94)
print("arr : ", arr)  
print("Q2 quantile of arr : ", np.quantile(arr, .50)) 
print("Q1 quantile of arr : ", np.quantile(arr, .25)) 
print("Q3 quantile of arr : ", np.quantile(arr, .75)) 
print("100th quantile of arr : ", np.quantile(arr, .1))

arr :  range(4, 94)
Q2 quantile of arr :  48.5
Q1 quantile of arr :  26.25
Q3 quantile of arr :  70.75
100th quantile of arr :  12.9

# Get sample from dataframe

In [ ]:
#change of the type of a column
df = pd.DataFrame({'num_legs': [2, 4, 8, 0],
                   'num_wings': [2, 0, 0, 0],
                   'num_specimen_seen': [10, 2, 1, 8]})

df.sample(2)

   num_legs  num_wings  num_specimen_seen
2         8          0                  1
1         4          0                  2

# Z-score Scipy

In [ ]:
a = np.array([ 0.7972,  0.0767,  0.4383,  0.7866,  0.8091,
              0.1954,  0.6307,  0.6599,  0.1065,  0.0508])
from scipy import stats
stats.zscore(a)

b = [1,2,1,2,10]
stats.zscore(b)

array([-0.64153303, -0.34992711, -0.64153303, -0.34992711,  1.98292027])

# Eval Strings

In [ ]:
#Sankey


import pandas as pd
import plotly
import plotly.plotly as py

def genSankey(df, cat_cols=[], value_cols='', title='Sankey Diagram'):
    # maximum of 6 value cols -> 6 colors
    colorPalette = ['#4B8BBE', '#306998', '#FFE873', '#FFD43B', '#646464']
    labelList = []
    colorNumList = []
    for catCol in cat_cols:
        labelListTemp = list(set(df[catCol].values))
        colorNumList.append(len(labelListTemp))
        labelList = labelList + labelListTemp

    # remove duplicates from labelList
    labelList = list(dict.fromkeys(labelList))

    # define colors based on number of levels
    colorList = []
    for idx, colorNum in enumerate(colorNumList):
        colorList = colorList + [colorPalette[idx]] * colorNum

    # transform df into a source-target pair
    for i in range(len(cat_cols) - 1):
        if i == 0:
            sourceTargetDf = df[[cat_cols[i], cat_cols[i + 1], value_cols]]
            sourceTargetDf.columns = ['source', 'target', 'count']
        else:
            tempDf = df[[cat_cols[i], cat_cols[i + 1], value_cols]]
            tempDf.columns = ['source', 'target', 'count']
            sourceTargetDf = pd.concat([sourceTargetDf, tempDf])
        sourceTargetDf = sourceTargetDf.groupby(['source', 'target']).agg({'count': 'sum'}).reset_index()

    # add index for source-target pair
    sourceTargetDf['sourceID'] = sourceTargetDf['source'].apply(lambda x: labelList.index(x))
    sourceTargetDf['targetID'] = sourceTargetDf['target'].apply(lambda x: labelList.index(x))

    # creating the sankey diagram
    data = dict(type='sankey',
        node=dict(pad=15, thickness=20, line=dict(color="black", width=0.5), label=labelList, color=colorList),
        link=dict(source=sourceTargetDf['sourceID'], target=sourceTargetDf['targetID'], value=sourceTargetDf['count']))

    layout = dict(title=title, font=dict(size=10))

    fig = dict(data=[data], layout=layout)
    return fig


df = pd.DataFrame({'num_legs': [2, 4, 8, 0],
                   'num_wings': [2, 0, 0, 0],
                   'num_specimen_seen': [10, 2, 1, 8]},
                  index=['falcon', 'dog', 'spider', 'fish'])

fig = genSankey(df,cat_cols=['lvl1','lvl2','lvl3','lvl4'],value_cols='count',title='Word Etymology')
plotly.offline.plot(fig, validate=False)

ImportError: ignored